tutorials/old/pimpleDyM_Piston/Allrun
#!/bin/sh
echo "executing blockMesh"
blockMesh > log.blockMesh

echo "executing pimpleDyMFoam"
pimpleDyMFoam > log.pimpleDyMFoam