tutorials/old/pimpleDyM_Piston/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    piston
    {
        type            patch;
        nFaces          40;
        startFace       1540;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       1580;
    }
    walls
    {
        type            patch;
        nFaces          40;
        startFace       1620;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          800;
        startFace       1660;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          800;
        startFace       2460;
    }
)

// ************************************************************************* //
